app/controllers/assets_controller.rb

INSERT INTO "assets" ("created_at", "updated_at", "uploaded_file_content_type", "uploaded_file_file_name", "uploaded_file_file_size", "uploaded_file_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @asset = current_user.assets.new(params[:asset])
    if @asset.save

SELECT "assets".* FROM "assets" WHERE "assets"."user_id" = 1 AND "assets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @asset = current_user.assets.find(params[:id])

SELECT "assets".* FROM "assets" WHERE "assets"."user_id" = 1 AND "assets"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "assets" SET "uploaded_file_file_name" = 'Koala.jpg', "uploaded_file_content_type" = 'image/jpeg', "uploaded_file_file_size" = 780831, "uploaded_file_updated_at" = '2013-04-07 12:36:34.037644', "updated_at" = '2013-04-07 12:36:34.090647' WHERE "assets"."id" = 1
---
  def update
    @asset = current_user.assets.find(params[:id])
    if @asset.update_attributes(params[:asset])

SELECT "assets".* FROM "assets" WHERE "assets"."user_id" = 1 AND "assets"."id" = ? LIMIT 1  [["id", "defaults"]]
DELETE FROM "assets" WHERE "assets"."id" = ?  [["id", 9]]
---
  def show
    @asset = current_user.assets.find(params[:id])
    @asset.destroy

SELECT "assets".* FROM "assets" WHERE "assets"."user_id" = 1 AND "assets"."id" = 2 LIMIT 1
---
  def get
    asset = current_user.assets.find_by_id(params[:id])