app/controllers/home_controller.rb

  def index
    if user_signed_in?
      @assets = Asset.order("uploaded_file_file_name desc")
---
SELECT "assets".* FROM "assets" ORDER BY uploaded_file_file_name desc