app/controllers/profile_controller.rb

  def index
    if user_signed_in?
      @assets = current_user.assets.order("uploaded_file_file_name desc")
---
SELECT "assets".* FROM "assets" WHERE "assets"."user_id" = 2 ORDER BY uploaded_file_file_name desc